In [1]:
import numpy as np
import pandas as pd

In [2]:
string_data= pd.Series(['aardvrk','artichoke',np.nan,'avocado'])
string_data

0      aardvrk
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [5]:
from numpy import nan as NA
data = pd.Series([1,NA,3.5,NA,7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [6]:
data[data.notnull()]#等价

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
data = pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [8]:
cleaned = data.dropna()# 默认丢弃所有NA的行
cleaned

     0    1    2
0  1.0  6.5  3.0

In [9]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [10]:
df = pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1] = NA
df.iloc[:2,2] = NA
df

          0         1         2
0 -0.332458       NaN       NaN
1  1.108183       NaN       NaN
2 -1.943890       NaN -1.605144
3 -1.664572       NaN  0.151649
4 -0.443475  0.287562 -0.625646
5  0.179337 -0.274491  0.603949
6 -0.911380 -0.339399  0.970252

In [11]:
df.dropna()

          0         1         2
4 -0.443475  0.287562 -0.625646
5  0.179337 -0.274491  0.603949
6 -0.911380 -0.339399  0.970252

In [12]:
df.dropna(thresh=2)

          0         1         2
2 -1.943890       NaN -1.605144
3 -1.664572       NaN  0.151649
4 -0.443475  0.287562 -0.625646
5  0.179337 -0.274491  0.603949
6 -0.911380 -0.339399  0.970252

In [13]:
df.fillna(0)

          0         1         2
0 -0.332458  0.000000  0.000000
1  1.108183  0.000000  0.000000
2 -1.943890  0.000000 -1.605144
3 -1.664572  0.000000  0.151649
4 -0.443475  0.287562 -0.625646
5  0.179337 -0.274491  0.603949
6 -0.911380 -0.339399  0.970252

In [14]:
df.fillna({1:0.5,2:0})

          0         1         2
0 -0.332458  0.500000  0.000000
1  1.108183  0.500000  0.000000
2 -1.943890  0.500000 -1.605144
3 -1.664572  0.500000  0.151649
4 -0.443475  0.287562 -0.625646
5  0.179337 -0.274491  0.603949
6 -0.911380 -0.339399  0.970252

In [15]:
_ = df.fillna(0,inplace=True)
df

          0         1         2
0 -0.332458  0.000000  0.000000
1  1.108183  0.000000  0.000000
2 -1.943890  0.000000 -1.605144
3 -1.664572  0.000000  0.151649
4 -0.443475  0.287562 -0.625646
5  0.179337 -0.274491  0.603949
6 -0.911380 -0.339399  0.970252

In [16]:
df = pd.DataFrame(np.random.randn(6,3))
df.iloc[2:,1] = NA
df.iloc[4:,2] = NA
df

          0         1         2
0  0.468224  0.956720 -0.624874
1  0.103039  0.375827 -0.983659
2  0.577874       NaN  0.707249
3  0.127919       NaN -0.685862
4 -0.828629       NaN       NaN
5  0.574172       NaN       NaN

In [17]:
df.fillna(method='ffill')

          0         1         2
0  0.468224  0.956720 -0.624874
1  0.103039  0.375827 -0.983659
2  0.577874  0.375827  0.707249
3  0.127919  0.375827 -0.685862
4 -0.828629  0.375827 -0.685862
5  0.574172  0.375827 -0.685862

In [18]:
df.fillna(method='ffill',limit=2)

          0         1         2
0  0.468224  0.956720 -0.624874
1  0.103039  0.375827 -0.983659
2  0.577874  0.375827  0.707249
3  0.127919  0.375827 -0.685862
4 -0.828629       NaN -0.685862
5  0.574172       NaN -0.685862

In [19]:
data = pd.Series([1,NA,3.5,NA,7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [20]:
data = pd.DataFrame({'k1':['one','two']*3 + ['two'],
                    'k2':[1,1,2,3,3,4,4,]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [21]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [22]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [23]:
data['v1'] = range(7)

In [24]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [25]:
data.drop_duplicates(['k1'],keep='last')

    k1  k2  v1
4  one   3   4
6  two   4   6

In [26]:
data = pd.DataFrame({'food':['bacon','pulled pork','bacon','Pastrami','corned beef',
                            'Bacon','pastrami','honey ham','novalox'],
                    'ounces':[4,3,12,6,7.5,8,3,5,6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8      novalox     6.0

In [27]:
meat_to_animal = {'bacon':'pig',
                 'pulled pork':'pig',
                 'pastrami':'cow',
                 'corned beef':'cow',
                 'honey ham':'pig',
                 'novalox':'salmon'}

In [28]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8        novalox
Name: food, dtype: object

In [29]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8      novalox     6.0  salmon

In [30]:
data = pd.Series([1,-999,2,-999,-1000,3])
data

0       1
1    -999
2       2
3    -999
4   -1000
5       3
dtype: int64

In [31]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [32]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [33]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [34]:
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [35]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                   index=['Ohio','Colorado','New York'],
                   columns=['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [36]:
transform = lambda x: x[:].upper()
transform

In [37]:
data.index.map(transform)

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [38]:
data.index = data.index.map(transform)
data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [39]:
data.rename(index=str.upper,columns=str.title)

          One  Two  Three  Four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [40]:
data.rename(index={'OHIO':'INDINA'},
           columns={'three':'five'})

          one  two  five  four
INDINA      0    1     2     3
COLORADO    4    5     6     7
NEW YORK    8    9    10    11

In [41]:
data.rename(index={'OHIO':'INDIANA'},inplace=True)
data

          one  two  three  four
INDIANA     0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [42]:
ages = [20,22,25,27,21,23,37,31,61,45,41,32]
bins = [18,25,35,60,100]
cats = pd.cut(ages,bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [43]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [44]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [45]:
pd.cut(ages,[18,26,36,61,100],right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [46]:
group_names = ['Youth','YouthAdult','MiddleAged','Senior']
pd.cut(ages,bins,labels=group_names)

[Youth, Youth, Youth, YouthAdult, Youth, ..., YouthAdult, Senior, MiddleAged, MiddleAged, YouthAdult]
Length: 12
Categories (4, object): [Youth < YouthAdult < MiddleAged < Senior]

In [47]:
data = np.random.rand(20)
pd.cut(data,4,precision=2)

[(0.69, 0.9], (0.69, 0.9], (0.082, 0.29], (0.49, 0.69], (0.29, 0.49], ..., (0.082, 0.29], (0.49, 0.69], (0.082, 0.29], (0.082, 0.29], (0.082, 0.29]]
Length: 20
Categories (4, interval[float64]): [(0.082, 0.29] < (0.29, 0.49] < (0.49, 0.69] < (0.69, 0.9]]

In [48]:
data = np.random.randn(1000)
cats = pd.cut(data,4)

In [49]:
pd.value_counts(cats)

(-0.195, 1.424]     489
(-1.814, -0.195]    406
(1.424, 3.042]       72
(-3.439, -1.814]     33
dtype: int64

In [50]:
data = pd.DataFrame(np.random.randn(1000,4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.012710    -0.015695    -0.033438     0.056578
std       0.983197     0.995941     1.004952     0.999184
min      -2.900821    -2.958904    -3.488728    -3.136922
25%      -0.643105    -0.672512    -0.724866    -0.644838
50%       0.042465    -0.066557    -0.008901     0.066858
75%       0.628642     0.673060     0.642808     0.778296
max       3.177102     3.166516     3.724668     3.727032

In [51]:
col = data[2]
col[np.abs(col)>3]

229   -3.488728
674    3.724668
796    3.401872
Name: 2, dtype: float64

In [52]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
152  3.177102  1.550905  0.033457  1.021687
229  1.819595 -0.396060 -3.488728  0.004215
301  0.476386  0.214832  0.103664 -3.136922
477  3.121294  0.650764 -0.202511 -0.981195
618  0.880466  3.166516 -1.309279 -0.378996
674 -0.296628 -0.221081  3.724668 -0.910126
734 -0.283437 -0.320114 -0.374230  3.727032
796  0.701488 -0.329129  3.401872  0.614390
817 -2.749544  0.927212 -0.539207  3.107311
942 -1.541459 -0.402548  1.080872  3.371243

In [53]:
data[np.abs(data)>3] = np.sign(data)*3

In [54]:
df = pd.DataFrame(np.arange(5*4).reshape((5,4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [55]:
sampler = np.random.permutation(5)
df.take(sampler)

    0   1   2   3
3  12  13  14  15
0   0   1   2   3
4  16  17  18  19
1   4   5   6   7
2   8   9  10  11

In [56]:
val = 'a,b, huide'
val.split(',')

['a', 'b', ' huide']

In [57]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'huide']

In [58]:
first,second,third = pieces
first + '::' + second + '::' + third

'a::b::huide'

In [59]:
'+'.join(pieces)

'a+b+huide'

In [60]:
import re
text = "fool bar\t baz \tqux"
re.split('\s+',text)

['fool', 'bar', 'baz', 'qux']

In [61]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
re.compile(pattern,flags=re.IGNORECASE).findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [62]:
data = {'Dave':'dave@google.com',
       'Steve':'steve@gmail.com',
       'Rob':'rob@gmail.com',
       'Wes':np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [63]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [64]:
pattern = '([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [65]:
data.str.findall(pattern,flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object